
package com.sazedur.bangalieasyrecipe;

import java.util.ArrayList;
import java.util.HashMap;

public class MakeVideoList {

	public static ArrayList rootArrayList;
	public static ArrayList< HashMap<String, String> > catArrayList;
	public static ArrayList< HashMap<String, String> > videoArrayList;
	public static HashMap<String, String> hashMap;


	//--------------------------------------------------------------------------------------------
	//===============================Some automation by Juba
	public static void addVideoItem(String video_id, String title, String desciption){
		hashMap = new HashMap<>();
		hashMap.put("vdo_id", video_id);
		hashMap.put("vdo_title", title);
		hashMap.put("vdo_desciption", desciption);
		videoArrayList.add(hashMap);
	}
	//========================================================================
	//===============================Some automation by Juba
	public static void createPlayList(String category_name, Integer drawable){
		rootArrayList.add(videoArrayList);
		hashMap = new HashMap<>();
		hashMap.put("category_name", category_name);
		hashMap.put("img", String.valueOf(drawable));
		catArrayList.add(hashMap);
		videoArrayList = new ArrayList<>();
	}
	//========================================================================





	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//----------------------------------------------------
	public static void createMyAlbums(){

		rootArrayList = new ArrayList();
		catArrayList = new ArrayList<>();
		videoArrayList = new ArrayList<>();






		//==========================================================================
		addVideoItem("g4xgTP447pE", "সেরা স্বাদে ব্রয়লার মুরগি ভুনা রেসিপি", "সেরা স্বাদে ব্রয়লার মুরগি ভুনা রেসিপি || Easy Broiler Chicken Bhuna Recipe");
		addVideoItem("1x8IF78ztvU", "গরুর মাংস রান্না", "সবাই আপনার রান্নার ভক্ত হবেই যদি এভাবে গরুর মাংস রান্না করেন | Tasty Beef Kosha Recipe");
		addVideoItem("p9fy3QN9Zs0", "আলু দিয়ে মুরগির ঝোল", "আলু দিয়ে মুরগির ঝোল | Bengali Style Chicken Aloo Jhol Recipe");
		addVideoItem("jDQbbAYUQ3U", "হোটেলের বাবুর্চির রান্না চিকেন ঝাল ফ্রাই", "হোটেলের বাবুর্চির রান্না চিকেন ঝাল ফ্রাই । মুরগির মাংস ঝাল ফ্রাই রান্না । Chicken Jhal Fry Recipe");
		createPlayList("মাংস রান্না রেসিপি", R.drawable.meat);
		//==========================================================================


		//==========================================================================
		addVideoItem("yzUY0B7Ubz0", "বাসন্তী পোলাও ", "বাসন্তী পোলাও । মিষ্টি পোলাও। TRADITIONAL BENGALI SWEET PULAO RECIPE");
		addVideoItem("ubSmTAMNasg", "ঝরঝরে সাদা পোলাও রেসিপি", "ঝরঝরে সাদা পোলাও রেসিপি | Plain Pulao Recipe | Polao Recipe");
		addVideoItem("eRqZTVsnEi4", "বাবুর্চি স্টাইলে বিয়ে বাড়ির পোলাউ", "বাবুর্চি স্টাইলে বিয়ে বাড়ির পোলাউ || Plain Polau Recipe Bangla ");
		addVideoItem("KPjrYdkOOEI", "একদম সহজে ঝামেলাহীন ভাবে চিকেন বিরয়ানী", "একদম সহজে ঝামেলাহীন ভাবে চিকেন বিরয়ানী | Chicken Biryani Recipe");
		createPlayList("পোলাও রান্না রেসিপি", R.drawable.polao);
		//==========================================================================


		//======================================ঈদের স্পেশাল রান্না====================================
		addVideoItem("INmwPMTjjzE", "খাসির পেশওয়ারী নামকিন গোশত রান্না!", "ঈদ স্পেশাল খুবই কম ঝামেলায় দারুন স্বাদের খাসির পেশওয়ারী নামকিন গোশত রান্না!");
		addVideoItem("Xbz4NYsR-0E", "বিফ পেপার স্টেক", "ঈদের স্পেশাল দারুন মজার খুবই সোজা ঝটপট তৈরি বিফ পেপার স্টেক ! Pepper Steak recipe");
		addVideoItem("Qoisb0kGNzg", "আম সাবুদানার ফিরনি পায়েস ! ", "ঈদ স্পেশাল দারুন মজার আম সাবুদানার ফিরনি পায়েস");
		addVideoItem("wrOdTIiu1iE", "বেশী স্বাদের নবাবী ফিরনি  ", "নবাবী সেমাই এর চেয়ে অনেক অনেক বেশী স্বাদের নবাবী ফিরনি");
		addVideoItem("zmzldRn-A6Y", "ফ্রুট কাস্টার্ড সেমাই রেসিপি", "এই ঈদে চেটেপুটে খাবার মতো ঘরে থাকা সাধারন জিনিষে তৈরি অসাধারণ স্বাদের ফ্রুট কাস্টার্ড সেমাই রেসিপি");
		addVideoItem("tiRbyW2au60", "উত্তরবংগের মশলাই আলু গোশত ", "দারুন মজা আর খুবই সোজা রান্না উত্তরবংগের মশলাই আলু গোশত ");
		addVideoItem("DbBX8qdtAT4", "চিকেন তান্দুরি বিরিয়ানি", "ঈদ স্পেশাল অসাধারণ স্বাদের চিকেন তান্দুরি বিরিয়ানি");
		addVideoItem("YM-fDkwoFnQ", "দারুন মজার কষা মাংস", "কুরবানির কষা মাংস-সবচেয়ে সহজে রান্না করে ফেলুন দারুন মজার কষা মাংস");
		addVideoItem("Z1iq8Ab0Aug", "কলিজা পরিস্কার করার পদ্ধতি সহ হায়দ্রাবাদি নিজামি দম কি কলিজি ভুনা রান্না", "ঈদ স্পেশাল রেসিপি খুবই সহজে কলিজা পরিস্কার করার পদ্ধতি সহ হায়দ্রাবাদি নিজামি দম কি কলিজি ভুনা রান্না");
		createPlayList("ঈদের স্পেশাল রান্না", R.drawable.eid);
		//==========================================================================

		//==========================================================================
		addVideoItem("sqZ8b5fTFRo", "কালোজাম বানানোর আসল রেসিপি ", "মিষ্টির দোকানের ময়রার তৈরি ছানার কালোজাম বানানোর আসল রেসিপি!");
		addVideoItem("otp4MQQIdXs", "ছানার কাঁচাগোল্লা বানানোর রেসিপি ", "ঢাকার মিষ্টির দোকানের ময়রার তৈরি ছানার কাঁচাগোল্লা বানানোর রেসিপি");
		addVideoItem("Y0BbnM6_eZA", "বাসি ছানা আর মাখন দিয়ে ঘরে তৈরি লালমোহন আর কালোজাম মিষ্টি ", "মিষ্টির দোকানের ময়রার রেসিপিতে বাসি ছানা আর মাখন দিয়ে ঘরে তৈরি লালমোহন আর কালোজাম মিষ্টি !");
		addVideoItem("8N8OPoSrXdY", "কাঁচা ছানা মিষ্টি", "মিষ্টির দোকানের ময়রার তৈরি দারুন মজার কাঁচা ছানা মিষ্টি");
		addVideoItem("5Zi9AXNVuz0", "ছানার লাড্ডু বানানোর রেসিপি", "মিষ্টির দোকানের ময়রার তৈরি দারুন মজার ছানার লাড্ডু");
		addVideoItem("897FDoown9o", "খেজুরের গুঁড়ের সন্দেশ বানানোর আসল রেসিপি", "মমিষ্টির দোকানের ময়রার তৈরি ছানার খেজুরের গুঁড়ের সন্দেশ বানানোর আসল রেসিপি ");
		addVideoItem("7O-YPrKpga4", "স্পঞ্জ রসগোল্লা মিষ্টি বানানোর রেসিপি", "মিষ্টির দোকানের ময়রার তৈরি দারুন মজার স্পঞ্জ রসগোল্লা মিষ্টি বানানোর রেসিপি");
		createPlayList("মিষ্টি তৈরির রেসিপি", R.drawable.sweet);
		//==========================================================================


		//==========================================================================
		addVideoItem("eSJnSPuR2Dc", "সকালের নাস্তা চিকেন সুপ", "হোটেলের বাবুর্চির রান্না সকালের নাস্তা চিকেন সুপ");
		addVideoItem("jDQbbAYUQ3U", "চিকেন ঝাল ফ্রাই", "হোটেলের বাবুর্চির রান্না চিকেন ঝাল ফ্রাই");
		addVideoItem("keRwACBM55g", "খাসির ডাল গোস্ত", "হোটেলের বাবুর্চির রান্না খাসির ডাল গোস্ত ");
		addVideoItem("0fNW-k4ZYjk", "খাসির শাহী চাপ", "হোটেলের বাবুর্চির রান্না খাসির শাহী চাপ । খাসীর মাংসের চাপ রান্নার রেসিপি ।");
		addVideoItem("A4bX7WRJRHA", "কলিজা ভুনা রান্নার রেসিপি ", "হসকালের নাস্তার কলিজা ভুনা রান্নার রেসিপি");
		addVideoItem("hQ30VvNKIQo", "গরুর মাংসের কালো ভুনা", "হোটেলের বাবুর্চির রান্না গরুর মাংসের কালা ভুনা ");
		addVideoItem("8jrh1hcLwXA", "খাসির রেজালা রেসিপি", "হহোটেলের বাবুর্চির রান্না খাসির রেজালা ");
		addVideoItem("q37QGBE1uUI", "গরুর রেজালা রেসিপি", "হোটেলের বাবুর্চির রান্না গরুর মাংসের রেজালা ");
		addVideoItem("iYtMBIZCDIs", "চিকেন ভুনা খিচুড়ি রেসিপি", "হোহোটেলের বাবুর্চির রান্না চিকেন ভুনা খিচুড়ি");
		addVideoItem("1frxKvparjc", "কাচ্চি বিরিয়ানি রান্নার রেসিপি", "হহোটেলের বাবুর্চির রান্না কাচ্চি বিরিয়ানি ।");
		createPlayList("বাবুর্চিদের রান্না রেসিপি", R.drawable.resturent);
		//==========================================================================


		//==========================================================================
		addVideoItem("j6sgSXS1Rig", "মাছের ডিমের রেসিপি", "মাছের ডিম রান্নার অসম্ভব মজার রেসিপি | Macher Dim Vuna");
		addVideoItem("CiruQ1PGQUc", " রুই মাছ ভুনা রান্না", "সবচেয়ে সহজে মাত্র কয়েক মিনিটে দুইটি মশলায় সবচেয়ে বেশি স্বাদের রুই মাছ ভুনা রান্না");
		addVideoItem("TxOQArpd7jU", "বোয়াল মাছের রেসিপি", "বোয়াল মাছের রেসিপি • পাঙ্গাস মাছও একই ভাবে রান্না করা যাবে |");
		addVideoItem("41q_BCS_Jx8", "নাগা ফিশ রেসিপি ", "Naga Fish Curry | সম্পূর্ণ অন্যরকমের খুবই অল্প মশলায় কিন্তু দারুন মজার সবচেয়ে সহজে মাছ রান্না !");
		addVideoItem("HNlBIBRa5YA", "লাউ চিংড়ি রেসিপি", "বোমাত্র একটি মশলা দিয়ে এভাবে লাউ চিংড়ি রান্না করলে অনেকদিন স্বাদ মুখে লেগে থাকবে!");
		addVideoItem("DUm-PvZ_J5k", "কই মাছের পাতুরি ", "বসবচেয়ে সহজে সবচেয়ে বেশী স্বাদের ঝামেলা ছাড়া মাছ রান্না - কই মাছের পাতুরি");
		addVideoItem("yY3AVx-X1_Y", "মাছের ঝোল রান্নার রেসিপি ", "এ ভিডিওতে শিখেনিন ভীষণ সহজ মাছের ঝোল রান্নার রেসিপি");
		addVideoItem("UnEbssyzLuI", "মাছ ভুনা রেসিপি", "নতুনদের জন্য পারফেক্ট মাছের রেসিপি");
		addVideoItem("37XRYavlWy4", "শোল মাছ দিয়ে মুলা ভর্তা রেসিপি ।", "দারুন মজার শোল মাছ দিয়ে একটা অসাধারন স্বাদের মুলা ভর্তা রেসিপি । Shol Mach Mula Vorta Recipe");
		addVideoItem("qW0tbqVdewY", "কবিগুরু রবীন্দ্রনাথ ঠাকুরের বাড়ীর দারুন মজার লেবু ভাপা কাতল মাছ রান্না", "Thakurbarir Ranna Recipe | কবিগুরু রবীন্দ্রনাথ ঠাকুরের বাড়ীর দারুন মজার লেবু ভাপা কাতল মাছ রান্না");
		createPlayList("মাছ রান্নার সহজ রেসিপি", R.drawable.fish);
		//==========================================================================

		//==========================================================================
		addVideoItem("g-oS5Sen5BA", "মুগ পাকন পিঠা রেসিপি", "মুগ পাকন পিঠা রেসিপি / Easy Bangladeshi Pitha");
		addVideoItem("AbEIOcwUlxw", "নরসিংদীর ঐতিহ্যবাহী নকশী পিঠা তৈরির আসল রেসেপি", "নরসিংদীর ঐতিহ্যবাহী নকশী পিঠা তৈরির আসল রেসেপি/ Traditional Nokshi Pitha Recipe");
		addVideoItem("JhXiViZSerU", "ময়দা আর চিনি দিয়ে মুচমুচে রসালো পিঠা", "ময়দা আর চিনি দিয়ে মুচমুচে রসালো পিঠা || Crispy And Juicy Flour Pitha Recipe");
		addVideoItem("Zs1pTmkf8dI", "Beautiful buns. Methods for forming buns.", "This video shows you how to shape buns");
		addVideoItem("ruDmlSu6Rek", "পোয়া পিঠা", "পোয়া পিঠা ফুলকো করার সহজ পদ্ধতিসহ খেজুরের গুড়ের পোয়া পিঠা। Pua Pitha Recipe | Fulko Pua Pitha");
		addVideoItem("gWmTMQLaW2I", "ভাপা পিঠা তৈরির রেসিপি", "পদুনিয়ার সবথেকে সহজে ভাপা পিঠা তৈরির রেসিপি। Easy & Quick Vapa Pitha");
		addVideoItem("B2BohOf15xQ", "ক্ষীরসা পাটিসাপটা পিঠা রেসিপি", "অল্প সময়ে দেশিও স্টাইলে খুব সহজে ক্ষীরসা পাটিসাপটা পিঠা রেসিপি | Patishapta Recipe");
		addVideoItem("gAcVX-Qu2AE", "তিম ও আটার মজাদার পিঠা রেসিপি", "ডিম ও আটার মজাদার পিঠা রেসিপি || Delicious Egg And Flour Recipe");
		createPlayList("বাংলাদেশি পিঠা রেসিপি", R.drawable.pitha);
		//==========================================================================

		//==========================================================================
		addVideoItem("kasGiUVpMq8", "অমলেট মাফিন কেক তৈরি", "ঝটপট সকালের নাস্তা বা বাচ্চাদের টিফিনের রেসিপি/চুলায় অমলেট মাফিন কেক তৈরি - Egg Omelette Muffin Cake");
		addVideoItem("IG7wWpiC9x0", "কয়েক মিনিটে সকালের নাস্তা বা টিফিনের রেসিপি", "কয়েক মিনিটে সকালের নাস্তা বা টিফিনের রেসিপি - Sokaler Nasta Bikaler Tifin Egg Roll Rannar Recipe");
		addVideoItem("fU6_xyzNwvo", "বাটার বন তৈরির রেসিপি", "গ্যাসের চুলায় বাটার বন তৈরির রেসিপি");
		addVideoItem("Ny68yen-Wnw", "মজাদার চিকেন স্যান্ডউইচ রেসিপি", "মজাদার চিকেন স্যান্ডউইচ রেসিপি/Spicy Chicken Sandwich");
		createPlayList("সকাল/বিকাল নাস্তা রেসিপি", R.drawable.nasta);
		//==========================================================================

		//==========================================================================
		addVideoItem("xqZnKU5UDTE", "কাঁকরোল ভর্তা রান্না রেসিপি", "কাঁকরোল ভর্তা রান্না রেসিপি - Bangladeshi Kakrol Vorta Recipe");
		addVideoItem("r80N6C4P-Wc", "১৫ রকমের ভর্তা বাটাবাটি বা ব্লেন্ড ছাড়া ", "১৫ রকমের ভর্তা বাটাবাটি বা ব্লেন্ড ছাড়া (বৈশাখ স্পেশাল) | Bangladeshi Vorta");
		addVideoItem("8vtwGfYRMTg", "ঢেঁড়স ভর্তা রান্না রেসিপি", "ঢেঁড়স ভর্তা রান্না রেসিপি - Bangladeshi Dheros Vorta Recipe");
		addVideoItem("bzKJE0XkDTY", "কচুর মুখি ভর্তা রান্না", "কচুর মুখি ভর্তা রান্না - Bangladeshi Kochur Mukhi Vorta Recipe");
		addVideoItem("WUUdt6KjfiM", "সাদা তিলের ভর্তা রেসিপি", "সহজ সাদা তিলের ভর্তা রেসিপি - Bangladeshi Tiler Vortar Video Recipe");
		addVideoItem("RtUGG1e1bqM", "সহজ কালিজিরা বা কালোজিরা ভর্তা", "সহজ কালিজিরা বা কালোজিরা ভর্তা - Bangladeshi Kalijira Vorta Recipe");
		addVideoItem("2PHS8BD9ILY", "বগুড়ার আঠালো আলু ভর্তা", "বগুড়ার আঠালো আলু ভর্তা - Bogurar Athalo Alu Vorta Recipe");
		createPlayList("ভর্তা তৈরির রেসিপি", R.drawable.vorta);
		//==========================================================================

		//==========================================================================
		addVideoItem("l1dMXyF64ns", "বরবটি সবজি ভাজি", "বরবটি সবজি ভাজি | Fried Borboti");
		addVideoItem("tchbuipZ88k", "অসাধারন সাধে সবজি রান্নার রেসিপি", "অসাধারন সাধে সবজি রান্নার রেসিপি/mix vegetables");
		addVideoItem("plpLtX5gn8w", "৩ টি সবজি দিয়ে চিকেন চাইনিজ ভেজিটেবল রান্না", "৩ টি সবজি দিয়ে চিকেন চাইনিজ ভেজিটেবল রান্না Bangladeshi Chinese vegetables Recipe | Vegetables");
		addVideoItem("xtBJk7kAN8Y", "বাবুর্চিদের রেসিপিতে বিয়ে বাড়ির সবজি", "বাবুর্চিদের রেসিপিতে বিয়ে বাড়ির সবজি | Biye Barir Sobji Recipe");
		createPlayList("সবজি ভাজি রেসিপি", R.drawable.vegetable);
		//==========================================================================



	}

	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>




}

